const Shops = [
	{
		name: "面珍",
		lat_lng: [35.70845418406614, 139.71717416931216],
		tags: ["油そば"],
	},
	{
		name: "キッチンオトボケ",
		lat_lng: [35.706776588199055, 139.71907539691807],
		tags: [],
	},
	{
		name: "武蔵野アブラ學会",
		lat_lng: [35.71171962426955, 139.71952874294462],
		tags: ["油そば"],
	},
	{
		name: "油SOBA 図星",
		lat_lng: [35.70764004597764, 139.71969788157577],
		tags: ["油そば"],
	},
	{
		name: "メルシー",
		lat_lng: [35.706693200360235, 139.72054769691786],
		tags: ["ラーメン"],
	},
	{
		name: "GOOD MORNING CAFE",
		lat_lng: [35.71065119965092, 139.72010261041146],
		tags: [],
	},
	{
		name: "早苗",
		lat_lng: [35.708164408397685, 139.7204466380891],
		tags: [],
	},
	{
		name: "高田牧舎",
		lat_lng: [35.7081594631302, 139.72020908157575],
		tags: [],
	},
	{
		name: "キッチンミキ",
		lat_lng: [35.71097446841128, 139.71917379506945],
		tags: [],
	},
	{
		name: "どんぴしゃり",
		lat_lng: [35.70749609154327, 139.71973099691792],
		tags: [],
	},
	{
		name: "ごんべえ",
		lat_lng: [35.706906693867595, 139.7181668663264],
		tags: [],
	},
	{
		name: "ボンボン食堂",
		lat_lng: [35.706453916714594, 139.72039961226025],
		tags: [],
	},
	{
		name: "三品食堂",
		lat_lng: [35.70941615960952, 139.71809646808256],
		tags: [],
	},
	{
		name: "かわうち",
		lat_lng: [35.7084037141569, 139.71705415274045],
		tags: [],
	},
	{
		name: "違う家",
		lat_lng: [35.70579386594474, 139.71998840856267],
		tags: ["ラーメン"],
	},
	{
		name: "麵爺",
		lat_lng: [35.70677281417933, 139.72060580163586],
		tags: ["油そば"],
	},
	{
		name: "GOSSOU",
		lat_lng: [35.707552125996486, 139.72574052868572],
		tags: ["ラーメン"],
	},
	{
		name: "らぁ麺やまぐち",
		lat_lng: [35.710105335162396, 139.71392388087565],
		tags: ["ラーメン"],
	},
	{
		name: "らーめんガラシャ",
		lat_lng: [35.71081489574959, 139.70985408078383],
		tags: ["ラーメン"],
	},
	{
		name: "ラーメン巌哲",
		lat_lng: [35.7112531874358, 139.72193001155668],
		tags: ["ラーメン"],
	},
];

export const GeoJson = {
	type: "FeatureCollection",
	features: Shops.map((shop) => {
		return {
			type: "Feature",
			geometry: {
				type: "Point",
				coordinates: shop.lat_lng.reverse(),
			},
			properties: {
				name: shop.name,
				tags: shop.tags,
			},
		};
	}),
};
